# vim: set filetype=ruby

# ┌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌┐
# ╎                           Taps                           ╎
# └╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌┘
tap "gcenx/wine"
tap "go-task/tap"
tap "avasilic/goto"
# ──────────────────────────────────────────────────────────────────────
tap "apple/apple", "http://github.com/apple/homebrew-apple" # TODO(@s0cks): rename to homebrew-apple 
tap "bufbuild/buf"
tap "charmbracelet/tap"
tap "felixkratz/formulae"
tap "get-woke/tap"
tap "hashicorp/tap"
tap "homebrew-ffmpeg/ffmpeg"
tap "how2terminal/how2"
tap "italomandara/cxpatcher"
tap "jorgelbg/tap"
tap "koekeishiya/formulae"
tap "lintje/lintje"
tap "lusingander/tap"
tap "mediosz/tap"
tap "microsoft/git"
tap "netmute/tap"
tap "nikitabobko/tap"
tap "orangekame3/tap"
tap "rawnly/tap"
tap "sikarugir-app/sikarugir"
tap "wader/tap"
tap "wtfutil/wtfutil"

# ┌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌┐
# ╎                        Formulaes                         ╎
# └╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌┘
brew "xz"
brew "jpeg-xl"
brew "glib"
brew "aom" # Library for encoding AV1
brew "libunistring" # Library for manipulating unicode strings
brew "libyaml" # Library for parsing YAML
brew "openssl@3"
brew "readline"
brew "aria2"
brew "atuin", restart_service: :changed
brew "autoconf"
brew "autoenv"
brew "automake"
brew "bat"
brew "freetype"
brew "harfbuzz"
brew "binsider" # Tool for analyzing ELF binaries
brew "bison"  
brew "libuv"
brew "bitwarden-cli"
brew "bitwise"
brew "unbound", restart_service: :changed
brew "gnutls"
brew "libgpg-error"
brew "libassuan"
brew "pinentry"
brew "gnupg"
brew "blackbox"
brew "bloaty"
brew "blueutil"
brew "bottom"
brew "pycparser"
brew "cffi"
brew "cryptography"
brew "buku"
brew "gcc" # TODO(@s0cks): remove?
brew "fftw"
brew "iniparser"
brew "portaudio"
brew "cava"
brew "ccache"
brew "check-jsonschema"
brew "chruby"
brew "clang-format"
brew "clipboard"
brew "code-server", restart_service: :changed
brew "commitizen"
brew "coreutils"
brew "cowsay"
brew "pcre"
brew "cppcheck"
brew "curl"
brew "diskonaut"
brew "doggo"
brew "dotbot"
brew "doxygen"
brew "dust"
brew "gflags"
brew "glog"
brew "snappy"
brew "eget"
brew "emojify"
brew "eva"
brew "eza"
brew "fastfetch"
brew "fclones"
brew "fd"
brew "flatbuffers"
brew "flex"
brew "flint-checker"
brew "libtool"
brew "pango"
brew "fontforge"
brew "fzf"
brew "forgit"
brew "fselect"
brew "fswatch"
brew "fx"
brew "libavif"
brew "gdbm"
brew "gdu"
brew "gh"
brew "git"
brew "git-delta"
brew "git-flow"
brew "git-standup"
brew "gitleaks"
brew "gitmoji"
brew "glew"
brew "glfw"
brew "glm"
brew "glow"
brew "gnu-sed"
brew "gpg-tui"
brew "gping"
brew "librsvg"
brew "graphviz"
brew "grpc"
brew "grpcurl"
brew "hadolint"
brew "hexyl"
brew "howdoi"
brew "httpie"
brew "hugo"
brew "hyperfine"
brew "llvm"
brew "include-what-you-use"
brew "jc"
brew "jnv"
brew "jq"
brew "jsonlint"
brew "lazygit"
brew "lcov"
brew "libass"
brew "libelf"
brew "libffi"
brew "libnotify"
brew "libpcap"
brew "libtensorflow"
brew "linkerd"
brew "lld"
brew "lnav"
brew "lolcat"
brew "lua-language-server"
brew "luacheck"
brew "luarocks"
brew "markdown-oxide"
brew "markdownlint-cli"
brew "marksman"
brew "mingw-w64"
brew "minisign"
brew "usage"
brew "mise"
brew "molten-vk"
brew "nap"
brew "navi"
brew "neovim"
brew "nom"
brew "nomino"
brew "onefetch"
brew "openssl@3.0"
brew "ossp-uuid"
brew "pastel"
brew "pinentry-mac"
brew "pkgconf"
brew "pre-commit"
brew "pyyaml"
brew "qt"
brew "rapidjson"
brew "rclone"
brew "ripgrep"
brew "rm-improved"
brew "runme"
brew "rustscan"
brew "sad"
brew "sdl2"
brew "shellcheck"
brew "spaceship"
brew "starship"
brew "tailspin"
brew "the_silver_searcher" # TODO(@s0cks): remove?
brew "thefuck"
brew "tidy-viewer"
brew "tlrc"
brew "tokei"
brew "tracy"
brew "tre-command"
brew "typos-cli"
brew "vcpkg"
brew "vcsh"
brew "viu"
brew "vivid"
brew "watchman"
brew "watson"
brew "winetricks"
brew "wtfutil"
brew "xq"
brew "yank"
brew "yazi"
brew "youtube-dl"
brew "yq"
brew "zellij"
brew "zenity"
brew "zoxide"

brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "avasilic/goto/goto-ssh"
brew "bufbuild/buf/buf"
brew "charmbracelet/tap/mods"
brew "charmbracelet/tap/wishlist"
brew "get-woke/tap/woke"
brew "go-task/tap/go-task"
brew "homebrew-ffmpeg/ffmpeg/ffmpeg", args: ["with-fdk-aac"]
brew "how2terminal/how2/how2"
brew "jorgelbg/tap/pinentry-touchid"
brew "lintje/lintje/lintje"
brew "lusingander/tap/serie"
brew "netmute/tap/ctags-lsp"
brew "orangekame3/tap/ghfetch"
brew "rawnly/tap/splash-cli"
brew "wader/tap/fq"

# ┌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌┐
# ╎                          Casks                           ╎
# └╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌┘
cask "aerospace"
cask "blackhole-2ch"
cask "caprine"
cask "container"
cask "espanso"
cask "font-hack-nerd-font"
cask "git-credential-manager"
cask "gitify"
cask "google-drive"
cask "gstreamer-runtime"
cask "gzdoom"
cask "hammerspoon"
cask "insomnia"
cask "keycastr"
cask "kitty"
cask "launchcontrol"
cask "linearmouse"
cask "mono-mdk"
cask "rar"
cask "raycast"
cask "sikarugir"
cask "stats"
cask "tomatobar"
cask "whisky"
cask "wine-crossover"
cask "xquartz"

# ┌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌┐
# ╎                            Go                            ╎
# └╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌┘
go "cmd/go"
go "cmd/gofmt"
