tap "abhimanyu003/sttr"
tap "adembc/tap"
tap "adoptopenjdk/openjdk"
tap "antoniorodr/cronboard"
tap "apple/apple", "http://github.com/apple/homebrew-apple"
tap "asmvik/formulae"
tap "avasilic/goto"
tap "bendews/tap"
tap "bufbuild/buf"
tap "charmbracelet/tap"
tap "felixkratz/formulae"
tap "gcenx/wine"
tap "get-woke/tap"
tap "git-chglog/git-chglog"
tap "go-task/tap"
tap "gromgit/brewtils"
tap "hashicorp/tap"
tap "homebrew-ffmpeg/ffmpeg"
tap "how2terminal/how2"
tap "italomandara/cxpatcher"
tap "jackielii/tap"
tap "jorgelbg/tap"
tap "koekeishiya/formulae"
tap "lintje/lintje"
tap "lusingander/tap"
tap "marioschwalbe/gcc-musl-cross"
tap "mediosz/tap"
tap "microsoft/git"
tap "netmute/tap"
tap "nik-rev/tap"
tap "nikitabobko/tap"
tap "noborus/tap"
tap "optum/tap"
tap "orangekame3/tap"
tap "plutov/tap"
tap "rawnly/tap"
tap "sikarugir-app/sikarugir"
tap "synchronal/tap"
tap "thezoraiz/ascii-image-converter"
tap "timescam/tap"
tap "umlx5h/tap"
tap "unhappychoice/tap"
tap "valkyrie00/bbrew"
tap "wader/tap"
tap "writeme-project/writeme"
tap "wtfutil/wtfutil"
brew "xz"
brew "jpeg-xl"
brew "aom"
brew "libunistring"
brew "glib"
brew "openssl@3"
brew "sqlite"
brew "aria2"
brew "asciinema"
brew "atuin", restart_service: :changed
brew "autoconf"
brew "autoenv"
brew "automake"
brew "bat"
brew "binsider"
brew "bison"
brew "libuv"
brew "node"
brew "bitwarden-cli"
brew "bitwise"
brew "unbound", restart_service: :changed
brew "gnutls"
brew "libgpg-error"
brew "libassuan"
brew "pinentry"
brew "gnupg"
brew "blackbox"
brew "bloaty"
brew "blueutil"
brew "bottom"
brew "freetype"
brew "gcc"
brew "fftw"
brew "iniparser"
brew "portaudio"
brew "cava"
brew "ccache"
brew "pycparser"
brew "cffi"
brew "harfbuzz"
brew "libavif"
brew "pango"
brew "librsvg"
brew "chruby"
brew "clang-format"
brew "clipboard"
brew "coreutils"
brew "pcre"
brew "cppcheck"
brew "cryptography"
brew "libyaml"
brew "ctags-lsp"
brew "curl"
brew "diskonaut"
brew "doggo"
brew "doxx"
brew "doxygen"
brew "gflags"
brew "glog"
brew "snappy"
brew "eget"
brew "emojify"
brew "eva"
brew "eza"
brew "fastfetch"
brew "fclones"
brew "fd"
brew "flatbuffers"
brew "flex"
brew "fnt"
brew "libtool"
brew "fontforge"
brew "fselect"
brew "fx"
brew "fzf"
brew "gdbm"
brew "gdu"
brew "gemini-cli"
brew "gh"
brew "git"
brew "git-delta"
brew "git-filter-repo"
brew "git-flow"
brew "git-quick-stats"
brew "git-standup"
brew "gitleaks"
brew "gitlogue"
brew "gitmoji"
brew "glew"
brew "glfw"
brew "glow"
brew "gnu-sed"
brew "terminal-notifier"
brew "gopass"
brew "gopass-jsonapi"
brew "gpg-tui"
brew "gping"
brew "graphviz"
brew "grex"
brew "grpc"
brew "grpcurl"
brew "hadolint"
brew "hexyl"
brew "hyperfine"
brew "imagemagick"
brew "llvm"
brew "include-what-you-use"
brew "irssi"
brew "jc"
brew "jnv"
brew "jq"
brew "jsonlint"
brew "kalker"
brew "lazydocker"
brew "lazygit"
brew "lazysql"
brew "lcov"
brew "lefthook"
brew "libass"
brew "libelf"
brew "libffi"
brew "libnotify"
brew "libpcap"
brew "libtensorflow"
brew "linkerd"
brew "lld"
brew "lolcat"
brew "lstr"
brew "lua-language-server"
brew "luacheck"
brew "luarocks"
brew "markdown-oxide"
brew "markdownlint-cli"
brew "mingw-w64"
brew "minisign"
brew "usage"
brew "mise"
brew "molten-vk"
brew "mq"
brew "nap"
brew "nasm"
brew "navi"
brew "nemu"
brew "neovim"
brew "ninja"
brew "nom"
brew "nomino"
brew "onefetch"
brew "openjdk@11"
brew "openssl@3.0"
brew "ossp-uuid"
brew "ouch"
brew "pastel"
brew "perl"
brew "pinentry-mac"
brew "pkgconf"
brew "pyyaml"
brew "qt"
brew "rage"
brew "rapidjson"
brew "rbw"
brew "rclone"
brew "ripgrep"
brew "rm-improved"
brew "runme"
brew "rustscan"
brew "sad"
brew "sdl2"
brew "serpl"
brew "shellcheck"
brew "shfmt"
brew "spaceship"
brew "starship"
brew "switchaudio-osx"
brew "tag"
brew "tailspin"
brew "termshark"
brew "terraform"
brew "the_silver_searcher"
brew "tidy-viewer"
brew "tlrc"
brew "tmux"
brew "tokei"
brew "tracy"
brew "tre-command"
brew "vale"
brew "vcpkg"
brew "vcsh"
brew "viddy"
brew "viu"
brew "vivid"
brew "w3m"
brew "watchman"
brew "watson"
brew "weechat"
brew "winetricks"
brew "wtfutil"
brew "wthrr"
brew "xmlstarlet"
brew "xq"
brew "yamlfmt"
brew "yank"
brew "yazi"
brew "youtube-dl"
brew "yq"
brew "zellij"
brew "zenity"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "abhimanyu003/sttr/sttr"
brew "adembc/tap/lazyssh"
brew "antoniorodr/cronboard/cronboard"
brew "asmvik/formulae/yabai"
brew "avasilic/goto/goto-ssh"
brew "bufbuild/buf/buf"
brew "charmbracelet/tap/mods"
brew "charmbracelet/tap/wishlist"
brew "felixkratz/formulae/borders"
brew "felixkratz/formulae/sketchybar"
brew "felixkratz/formulae/svim"
brew "get-woke/tap/woke"
brew "git-chglog/git-chglog/git-chglog"
brew "go-task/tap/go-task"
brew "gromgit/brewtils/taproom"
brew "homebrew-ffmpeg/ffmpeg/ffmpeg", args: ["with-fdk-aac"]
brew "how2terminal/how2/how2"
brew "jackielii/tap/skhd-zig"
brew "jorgelbg/tap/pinentry-touchid"
brew "lintje/lintje/lintje"
brew "lusingander/tap/serie"
brew "nik-rev/tap/countryfetch"
brew "noborus/tap/ov"
brew "orangekame3/tap/ghfetch"
brew "rawnly/tap/splash-cli"
brew "synchronal/tap/medic"
brew "thezoraiz/ascii-image-converter/ascii-image-converter"
brew "timescam/tap/pay-respects"
brew "umlx5h/tap/gtrash"
brew "unhappychoice/tap/gittype"
brew "valkyrie00/bbrew/bbrew"
brew "wader/tap/fq"
brew "writeme-project/writeme/writeme"
cask "aerospace"
cask "blackhole-2ch"
cask "caprine"
cask "container"
cask "espanso"
cask "font-hack-nerd-font"
cask "font-noto-sans-cjk"
cask "git-credential-manager"
cask "gitify"
cask "google-drive"
cask "gstreamer-runtime"
cask "gzdoom"
cask "hammerspoon"
cask "insomnia"
cask "keycastr"
cask "kitty"
cask "launchcontrol"
cask "linearmouse"
cask "mono-mdk"
cask "oq"
cask "rar"
cask "raycast"
cask "sikarugir"
cask "stats"
cask "swipeaerospace"
cask "tomatobar"
cask "wezterm"
cask "whisky"
cask "wine-crossover"
cask "xquartz"
go "cmd/go"
go "cmd/gofmt"
go "golang.org/x/tools/gopls"
go "github.com/ashish0kumar/stormy"
go "taskfile-language-server"
go "github.com/samyakbardiya/trex"
go "github.com/mrusme/zeit"
cargo "basalt-tui"
cargo "blindfold"
cargo "bookokrat"
cargo "chess-tui"
cargo "dash-create"
cargo "envex"
cargo "git-graph"
cargo "hx"
cargo "imagecli"
cargo "jnv"
cargo "jsonschema-cli"
cargo "koji"
cargo "octotype"
cargo "pik"
cargo "procx"
cargo "repgrep"
cargo "sd"
cargo "stylua"
cargo "tenki"
cargo "teracli"
cargo "termusic"
cargo "termusic-server"
cargo "tetrs_tui"
